In [1]:
import numpy as np
import pandas as pd

In [2]:
data = pd.read_csv(r'C:\Users\saket\Desktop\courses\TF\100daysofML\Time Series Analysis\Index2018.csv')

In [3]:
data_copy = data.copy()

In [8]:
## finding length of the time period
data_copy.date.describe()

count                    6269
unique                   6269
top       1999-08-23 00:00:00
freq                        1
first     1994-01-07 00:00:00
last      2018-01-29 00:00:00
Name: date, dtype: object

In [6]:
## Converting to date
data_copy.date = pd.to_datetime(data_copy.date,dayfirst = True)

In [7]:
data_copy.head()

        date     spx      dax     ftse    nikkei
0 1994-01-07  469.90  2224.95  3445.98  18124.01
1 1994-01-10  475.27  2225.00  3440.58  18443.44
2 1994-01-11  474.13  2228.10  3413.77  18485.25
3 1994-01-12  474.17  2182.06  3372.02  18793.88
4 1994-01-13  472.47  2142.37  3360.01  18577.26